OF_Sims/planar_Sims/100_cell_5dT/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     dropwiseFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          1e-4;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision   8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;



functions
{
// wallHeatFlux1
// {
//     // Mandatory entries (unmodifiable)
//     // type            wallHeatFlux;
//     // libs            (fieldFunctionObjects);

//     // Optional entries (runtime modifiable)
//     // patches     (<wall>); // (wall1 "(wall2|wall3)");
//     // qr          qr;

//     // Optional (inherited) entries
//     // writePrecision  8;
//     // writeToFile     true;
//     // useUserTime     true;
//     // region          region0;
//     // enabled         true;
//     // log             true;
//     // timeStart       0;
//     // timeEnd         5;
//     // executeControl  timeStep;
//     // executeInterval 1;
//     // writeControl    timeStep;
//     // writeInterval   1;
// }
}

// ************************************************************************* //
